app/controllers/artists_controller.rb

  def show
    @artist = Artist.find(:all,:conditions=>["Name=:id",params])
    respond_to do |format|
      if @artist[0].nil?
        format.xml { render :xml => "<message>empty</message>" }
      else
        if params[:status].nil?
          format.xml { render :xml => @artist[0] }
        else
          @artist[0].Status = params[:status]
          if @artist[0].save
---
SELECT * FROM "artists" WHERE (Name='zhangsan')
UPDATE "artists" SET "updated_at" = '2010-07-25 06:03:59', "Status" = 1 WHERE "id" = 1

  def create
    @artist = Artist.new(params[:artist])
    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("Status", "created_at", "Name", "updated_at", "IP", "Index", "Ports", "RoomName") VALUES(0, '2010-07-25 06:00:29', 'p1', '2010-07-25 06:00:29', '192.168.0.1', 0, NULL, 'room1')