app/controllers/rooms_controller.rb

  def show
    if params[:status].nil?
      @room = Room.find(:all,:conditions=>["Name=:id",params])
      respond_to do |format|
        if @room[0].nil?
          format.xml { render :xml => "<message>empty</message>" }
        else
          format.xml { render :xml => @room[0] }
        end
      end
    else
      case params[:status]
      when "delete"
        Script.find(:all).each{|r| r.destroy}
        #Artist.find(:all).each{|r| r.destroy}
        #Room.find(:all).each{|r| r.destroy}
        Artist.find(:all,:conditions=>["RoomName=:id",params]).each{|r| r.destroy}
        Room.find(:all,:conditions=>["Name=:id",params]).each{|r| r.destroy}
        respond_to do |format|
          format.xml { render :xml => "<message>ok</message>" }
        end
      when "remove"
        Room.find(:all).each{|r|
          if r.Artists.include?params[:id]
            r.Artists=","+r.Artists
            r.Artists=r.Artists.gsub(","+params[:id],"")
            r.Artists=r.Artists[1..r.Artists.length]
            r.save
---
SELECT * FROM "rooms" WHERE (Name='p1')
DELETE FROM "artists" WHERE "id" = 1
DELETE FROM "rooms" WHERE "id" = 1
SELECT * FROM "artists" WHERE (RoomName='room1')
SELECT * FROM "artists"
SELECT * FROM "rooms"
SELECT * FROM "scripts"
UPDATE "rooms" SET "updated_at" = '2010-08-14 05:08:58', "Artists" = ',p2,p3' WHERE "id" = 2

  def create
    @room = Room.new(params[:room])
    respond_to do |format|
      if @room.save
---
INSERT INTO "rooms" ("created_at", "Name", "Artists", "updated_at") VALUES('2010-07-25 05:52:29', 'room1', 'p1,p2,p3', '2010-07-25 05:52:29')