app/controllers/scripts_controller.rb

  def server
    @artist = Artist.find(:all,:conditions=>["Name=:id",params])
    if @artist[0].nil?
      respond_to do |format|
        format.xml { render :xml => "<message>empty</message>" }
      end
    else
      @room = Room.find(:all,:conditions=>["Name=:id",{:id=>@artist[0].RoomName}])
---
SELECT * FROM "artists" WHERE (Name='zhangsan')
SELECT * FROM "rooms" WHERE (Name='room1')

  def client
    @artist = Artist.find(:all,:conditions=>["Name=:id",params])
    if @artist[0].nil?
      respond_to do |format|
        format.xml { render :xml => "<message>empty</message>" }
      end
    else
      @room = Room.find(:all,:conditions=>["Name=:id",{:id=>@artist[0].RoomName}])
---
SELECT * FROM "artists" WHERE (Name='p1')
SELECT * FROM "rooms" WHERE (Name='room1')