app/controllers/users_controller.rb

  def show
    case params[:status]
    when "delete"
      @user = User.find(:all,:conditions=>["Name=:id",params])
      respond_to do |format|
        if @user[0].nil?
          format.xml { render :xml => "<message>empty</message>" }
        else
          @user[0].destroy
---
SELECT * FROM "users" WHERE (Name='zzz')
DELETE FROM "users" WHERE "id" = 1

  def create
    @user = User.new(params[:user])
    @users = User.find(:all,:conditions=>["Name=:Name",@user])
    respond_to do |format|
      if @users[0].nil?
        if @user.save
---
SELECT * FROM "users" WHERE (Name=:Name)
INSERT INTO "users" ("Status", "created_at", "Name", "updated_at") VALUES(0, '2010-08-10 18:24:01', 'zhangsan', '2010-08-10 18:24:01')